#include "GPIO.h"

/*==============================================================================
 对外函数
 *============================================================================*/

/**
 * @brief  初始化板级GPIO模式和软件I2C上拉
 * @param  无
 * @retval 无
 */
void GPIO_Init(void)
{
    P0M0 = 0x80u; P0M1 = 0x00u;
    P1M0 = 0x02u; P1M1 = 0x00u;
    P2M0 = 0x00u; P2M1 = 0x00u;
    P3M0 = 0x1Eu; P3M1 = 0x00u;
    P4M0 = 0x00u; P4M1 = 0x00u;
    P5M0 = 0x11u; P5M1 = 0x00u;

    P_SW2 |= 0x80u;
    P0PU |= 0x16u;
    P2PU |= 0x60u;
    P4PU |= 0x60u;
    P5PU |= 0x04u;
    P_SW2 &= 0x7Fu;
}
